InformationRegisters/СенсорныйЕкран_НастройкиПользователей_СД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СенсорныйЕкран_НастройкиПользователей_СД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПарольОператора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетнаяЗаписьДляОтправкиПисем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EmailДляОтправикиПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияПоставки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EmailДляОтправикиПисьма_КассовыеШины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказыватьЦенуЗакупки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветственныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоВход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловиеПриема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияПриема</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыТекстовЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыТекстовЭлектронныхПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTMLСКартинками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВложенияЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ВложенияЭлектронныхПисем</Name>
			<Comment>Вложения электронных писем</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДФайлаПочтовогоПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СенсорныйЕкран_СД/Ext/Module.bsl
Функция ВводЧисла(ЧислоЗначение,мБезДробнойЧасти = Ложь,мНеЗаполнятьСотые = Ложь,мРежимПароля = Ложь,мПоказыватьПароль = Ложь,мВводТелефона = ложь,мОграничениеЧисла = 0) Экспорт 
	Форма_СД = ПолучитьОбщуюФорму("СенсорныйЕкран_ВводЧисла_СД");
	Форма_СД.мЗначеЧисла 		= ЧислоЗначение;
	Форма_СД.мБезДробнойЧасти 	= мБезДробнойЧасти;
	Форма_СД.мНеЗаполнятьСотые 	= мНеЗаполнятьСотые;
	Форма_СД.мРежимПароля 		= мРежимПароля;
	Форма_СД.мПоказыватьПароль 	= мПоказыватьПароль;
	Форма_СД.мВводТелефона 		= мВводТелефона;
	Форма_СД.мОграничениеЧисла 	= мОграничениеЧисла;
	Форма_СД.ОткрытьМодально();

	ЧислоЗначение = СтрЗаменить(Форма_СД.мЗначеЧисла,Символы.НПП,"");
	
	Возврат ЧислоЗначение;
КонецФункции

Функция ПоискПоляПоПаролю(ЗначениеПароля)Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СенсорныйЕкран_НастройкиПользователей_СД.Оператор
		|ИЗ
		|	РегистрСведений.СенсорныйЕкран_НастройкиПользователей_СД КАК СенсорныйЕкран_НастройкиПользователей_СД
		|ГДЕ
		|	СенсорныйЕкран_НастройкиПользователей_СД.ПарольОператора = &ПарольОператора";
	
	Запрос.УстановитьПараметр("ПарольОператора", ЗначениеПароля);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Оператор;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции  

Функция ПолучитьПараметрыПользователя(Пользователь)Экспорт 
	//+БП: d.matyash (03.12.2024) <> 
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Оператор",Справочники.Пользователи.ПустаяСсылка());
	СтруктураВозврата.Вставить("УсловиеПриема",Справочники.УсловияПриема.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СенсорныйЕкран_НастройкиПользователей_СД.Оператор,
		|	СенсорныйЕкран_НастройкиПользователей_СД.УсловиеПриема
		|ИЗ
		|	РегистрСведений.СенсорныйЕкран_НастройкиПользователей_СД КАК СенсорныйЕкран_НастройкиПользователей_СД
		|ГДЕ
		|	СенсорныйЕкран_НастройкиПользователей_СД.Оператор = &Оператор";
	
	Запрос.УстановитьПараметр("Оператор", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл    
		ЗаполнитьЗначенияСвойств(СтруктураВозврата,ВыборкаДетальныеЗаписи);
		Возврат СтруктураВозврата;
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	//-БП: d.matyash (03.12.2024) <>	
КонецФункции


Процедура ВывестиОповещение(ТекстСообщения)Экспорт 
	Форма_СД = ПолучитьОбщуюФорму("СенсорныйЕкран_ФормаОповещения");
	Форма_СД.мВопрос = ТекстСообщения;
	Форма_СД.ПоложениеОкна = ВариантПоложенияОкна.Центрировать;
	Форма_СД.ОткрытьМодально();
КонецПроцедуры

Функция ВывестиВопрос(ТекстСообщения,РежимДаНет = истина)Экспорт 
	Форма_СД 				= ПолучитьОбщуюФорму("СенсорныйЕкран_ФормаВопроса_СД");
	Форма_СД.мВопрос 		= ТекстСообщения;
	Форма_СД.мДаНет 		= РежимДаНет;
	Форма_СД.ПоложениеОкна 	= ВариантПоложенияОкна.Центрировать;
	Форма_СД.ОткрытьМодально();
	
	Возврат Форма_СД.мРезультат;
КонецФункции

Функция ВыборИзТабл(ТаблицаЗнач)Экспорт
	Форма_СД = ПолучитьОбщуюФорму("СенсорныйЕкран_ФормаВыбораИзТаблицы");
	Форма_СД.мТабл = ТаблицаЗнач;
	Форма_СД.ПоложениеОкна = ВариантПоложенияОкна.Центрировать;  
	Форма_СД.ОткрытьМодально();
	
	
	ВыбранаяСтрока = Форма_СД.мСтрокаВыбора;
	
	Возврат ВыбранаяСтрока;
КонецФункции

Функция ПолучитьНастройкиПользователя(Пользователь)Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СенсорныйЕкран_НастройкиПользователей_СД.Оператор,
		|	СенсорныйЕкран_НастройкиПользователей_СД.ПарольОператора,
		|	СенсорныйЕкран_НастройкиПользователей_СД.Статус,
		|	СенсорныйЕкран_НастройкиПользователей_СД.Организация,
		|	СенсорныйЕкран_НастройкиПользователей_СД.Склад,
		|	СенсорныйЕкран_НастройкиПользователей_СД.ФормаРасчета,
		|	СенсорныйЕкран_НастройкиПользователей_СД.Подразделение,
		|	СенсорныйЕкран_НастройкиПользователей_СД.УчетнаяЗаписьДляОтправкиПисем,
		|	СенсорныйЕкран_НастройкиПользователей_СД.EmailДляОтправикиПисьма,
		|	СенсорныйЕкран_НастройкиПользователей_СД.УсловияДоставки,
		|	СенсорныйЕкран_НастройкиПользователей_СД.ТипЦены,
		|	СенсорныйЕкран_НастройкиПользователей_СД.МаксПроцентСкидки,
		|	СенсорныйЕкран_НастройкиПользователей_СД.МаксПроцентНаценки,
		|	СенсорныйЕкран_НастройкиПользователей_СД.EmailДляОтправикиПисьма_КассовыеШины,
		|	СенсорныйЕкран_НастройкиПользователей_СД.ПоказыватьЦенуЗакупки,
		|	СенсорныйЕкран_НастройкиПользователей_СД.ОтветственныйМенеджер
		|ИЗ
		|	РегистрСведений.СенсорныйЕкран_НастройкиПользователей_СД КАК СенсорныйЕкран_НастройкиПользователей_СД
		|ГДЕ
		|	СенсорныйЕкран_НастройкиПользователей_СД.Оператор = &Оператор";
	
	Запрос.УстановитьПараметр("Оператор", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи;
	КонецЦикла;
	
	Возврат Неопределено;
	

КонецФункции

Процедура ОтправитьПисьмо(УчетнаяЗапись,Тема,АдресПолучателя,ПутьНаДискуКФайлу,ИмяФайла)Экспорт 
	
	
	СтворенняЕлектроногоЛиста = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	СтворенняЕлектроногоЛиста.Дата = ТекущаяДата();
	
	НоваяСтрока = СтворенняЕлектроногоЛиста.КомуТЧ.Добавить();
	
	НоваяСтрока.АдресЭлектроннойПочты =  АдресПолучателя;
	НоваяСтрока.Представление = АдресПолучателя;
	
	СтворенняЕлектроногоЛиста.КомуПредставление = АдресПолучателя;			
	СтворенняЕлектроногоЛиста.Кому = АдресПолучателя;
	
	СтворенняЕлектроногоЛиста.ОтправительАдресЭлектроннойПочты = УчетнаяЗапись.АдресЭлектроннойПочты;
	СтворенняЕлектроногоЛиста.ОтправительПредставление = УчетнаяЗапись.АдресЭлектроннойПочты;
	
	СтворенняЕлектроногоЛиста.Тема = Тема;			
	СтворенняЕлектроногоЛиста.УчетнаяЗапись = УчетнаяЗапись;
	СтворенняЕлектроногоЛиста.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.Текст;
	СтворенняЕлектроногоЛиста.ЕстьВложения = истина;
	СтворенняЕлектроногоЛиста.Записать();
	
	Вложение = Справочники.ВложенияЭлектронныхПисем.СоздатьЭлемент() ;
	Вложение.Объект = СтворенняЕлектроногоЛиста.Ссылка;
	Вложение.ИмяФайла = ИмяФайла;//""+ТекущаяДата()+".xls";
	Вложение.Хранилище = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ПутьНаДискуКФайлу)); 
	Вложение.Записать();
	
	//Попытка
	
	СтворенняЕлектроногоЛиста.ОтправитьПисьмо();

КонецПроцедуры
